TestPlans/Car/Acorn Direct/xml/ACD3_25112014_5.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Quote xmlns="http://TGSL/TES_Aggregator">
      <lxmlTGSLXML>
        <tgsl xmlns="http://www.transactorgsl.com/schemas">
          <aggregator>comparethemarket</aggregator>
          <domain>http://localhost</domain>
          <partner>
            <partnerName>acorn</partnerName>
            <broker>acorn</broker>
          </partner>
          <product>motor</product>
        </tgsl>
      </lxmlTGSLXML>
      <lstrRiskXML>
        <p:motorRisk xmlns:p="http://www.transactorgsl.com/schemas" xmlns="http://www.transactorgsl.com/schemas">
          <p:insuredParty instance="1">
            <p:accessToOtherVehicles>true</p:accessToOtherVehicles>
            <p:client>true</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>true</p:criminalOffence>
            <p:dateLicenceObtained>2010-11-20T00:00:00</p:dateLicenceObtained>
            <p:dob>1977-05-05T00:00:00</p:dob>
            <p:email>transformerPC05@emailreaction.org</p:email>
            <p:forename>Edward</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>P</p:licenceTypeID>
            <p:mainDriver>true</p:mainDriver>
            <p:maritalStatusID>M</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:numberOfVehiclesAccessTo>8</p:numberOfVehiclesAccessTo>
            <p:password>compareDM</p:password>
            <p:sex>Male</p:sex>
            <p:surname>Five</p:surname>
            <p:titleID>001</p:titleID>
            <p:ukResidenceYears>37</p:ukResidenceYears>
            <p:vehicleUseID>18</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:insuredParty instance="2">
            <p:accessToOtherVehicles>true</p:accessToOtherVehicles>
            <p:client>false</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>1994-11-20T00:00:00</p:dateLicenceObtained>
            <p:dob>1976-06-04T00:00:00</p:dob>
            <p:email />
            <p:forename>Adam</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>F</p:licenceTypeID>
            <p:mainDriver>false</p:mainDriver>
            <p:maritalStatusID>M</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:relationshipID>S</p:relationshipID>
            <p:password>compareDM</p:password>
            <p:sex>Male</p:sex>
            <p:surname>One</p:surname>
            <p:titleID>003</p:titleID>
            <p:ukResidenceYears>38</p:ukResidenceYears>
            <p:vehicleUseID>18</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:insuredParty instance="3">
            <p:accessToOtherVehicles>false</p:accessToOtherVehicles>
            <p:client>false</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2007-11-20T00:00:00</p:dateLicenceObtained>
            <p:dob>1980-10-08T00:00:00</p:dob>
            <p:email />
            <p:forename>Esme</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>E</p:licenceTypeID>
            <p:mainDriver>false</p:mainDriver>
            <p:maritalStatusID>D</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:relationshipID>M</p:relationshipID>
            <p:password>compareDM</p:password>
            <p:sex>Female</p:sex>
            <p:surname>Five</p:surname>
            <p:titleID>002</p:titleID>
            <p:ukResidenceYears>34</p:ukResidenceYears>
            <p:vehicleUseID>18</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:correspondanceAddress instance="1">
            <p:city>Manchester</p:city>
            <p:country />
            <p:county>Lancashire</p:county>
            <p:house>174</p:house>
            <p:locality>Swinton</p:locality>
            <p:postcode>M27 0WN</p:postcode>
            <p:street>Partington Lane</p:street>
          </p:correspondanceAddress>
          <p:occupation instance="1" insuredPartyInstance="1">
            <p:employersBusinessID>323</p:employersBusinessID>
            <p:employmentStatusID>E</p:employmentStatusID>
            <p:occupationID>653</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:occupation instance="1" insuredPartyInstance="2">
            <p:employersBusinessID>726</p:employersBusinessID>
            <p:employmentStatusID>E</p:employmentStatusID>
            <p:occupationID>03A</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:occupation instance="1" insuredPartyInstance="3">
            <p:employersBusinessID>186</p:employersBusinessID>
            <p:employmentStatusID>R</p:employmentStatusID>
            <p:occupationID>R09</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:telephone instance="1">
            <p:telephoneNumber>01733320301</p:telephoneNumber>
            <p:telephoneTypeID>3AJPQ7C6</p:telephoneTypeID>
          </p:telephone>
          <p:claim instance="1" insuredPartyInstance="1">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID>7</p:claimDetailsID>
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>A</p:claimTypeID>
            <p:dateOfClaim>2012-01-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>true</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>3000.00</p:totalCost>
          </p:claim>
          <p:claim instance="2" insuredPartyInstance="2">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID>1</p:claimDetailsID>
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>T</p:claimTypeID>
            <p:dateOfClaim>2011-08-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>false</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>0.00</p:totalCost>
          </p:claim>
          <p:claim instance="3" insuredPartyInstance="3">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID>1</p:claimDetailsID>
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>F</p:claimTypeID>
            <p:dateOfClaim>2011-12-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>false</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>0.00</p:totalCost>
          </p:claim>
          <p:cover instance="1">
            <p:coverRequiredID>01</p:coverRequiredID>
            <p:coverStartDate>2014-11-20T00:00:00</p:coverStartDate>
            <p:previousInsurance>true</p:previousInsurance>
            <p:previousInsuranceExpiryDate>2014-11-20T00:00:00</p:previousInsuranceExpiryDate>
            <p:previousInsurancePolicyNumber>1</p:previousInsurancePolicyNumber>
            <p:previousInsurerID>999</p:previousInsurerID>
            <p:voluntaryExcess>600</p:voluntaryExcess>
          </p:cover>
          <p:vehicle instance="1">
            <p:abiCode>52011702</p:abiCode>
            <p:annualMileage>7000</p:annualMileage>
            <p:bodyTypeID>01</p:bodyTypeID>
            <p:businessMileage>5000</p:businessMileage>
            <p:currentMileage>0</p:currentMileage>
            <p:dateOfPurchase>2007-10-01T00:00:00</p:dateOfPurchase>
            <p:fuelTypeID>002</p:fuelTypeID>
            <p:gearboxTypeID>002</p:gearboxTypeID>
            <p:imported>false</p:imported>
            <p:increasedBHP>0</p:increasedBHP>
            <p:keeperID>2</p:keeperID>
            <p:kitCar>false</p:kitCar>
            <p:leftHandDrive>false</p:leftHandDrive>
            <p:modifiedWhilstOwned>false</p:modifiedWhilstOwned>
            <p:numberOfDoors>5</p:numberOfDoors>
            <p:numberOfSeats>5</p:numberOfSeats>
            <p:ownerID>2</p:ownerID>
            <p:overnightParkingID>H</p:overnightParkingID>
            <p:pricePaid>2345</p:pricePaid>
            <p:qPlated>false</p:qPlated>
            <p:registrationNumber>X779NBM</p:registrationNumber>
            <p:usedForTrackDays>false</p:usedForTrackDays>
            <p:value>2345</p:value>
            <p:vehicleCC>1389</p:vehicleCC>
            <p:vehicleMake>Vauxhall</p:vehicleMake>
            <p:vehicleModel>Astra</p:vehicleModel>
            <p:yearOfManufacture>2000</p:yearOfManufacture>
          </p:vehicle>
          <p:ncd instance="1">
            <p:ncdYears>1</p:ncdYears>
            <p:protectedNCD>false</p:protectedNCD>
          </p:ncd>
          <p:garageAddress instance="1">
            <p:city>Manchester</p:city>
            <p:country />
            <p:county>Lancashire</p:county>
            <p:house>174</p:house>
            <p:locality>Swinton</p:locality>
            <p:postcode>M27 0WN</p:postcode>
            <p:street>Partington Lane</p:street>
          </p:garageAddress>
          <p:security instance="1">
            <p:dateFitted>2014-11-17T00:00:00</p:dateFitted>
            <p:fittedByID>4</p:fittedByID>
            <p:securityID>93</p:securityID>
          </p:security>
        </p:motorRisk>
      </lstrRiskXML>
    </Quote>
  </soap:Body>
</soap:Envelope>